src/Documents/ЗакрытиеСтанции/ЗакрытиеСтанции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеСтанции</name>
  <attributes>
    <name>Станция</name>
    <type>
      <types>CatalogRef.Станции</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>EnumRef.СтатусыСтанций</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыДляПеремещения</name>
    <attributes>
      <name>ТоварНаСтанции</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтанцияПеремещения</name>
      <type>
        <types>CatalogRef.Станции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗакрытиеСтанции/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура СтанцияПриИзмененииНаСервере()
	Объект.ТоварыДляПеремещения.Очистить();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Станция = &Станция";
	
	Запрос.УстановитьПараметр("Станция", Объект.Станция);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НовСтр = Объект.ТоварыДляПеремещения.Добавить();
		НовСтр.ТоварНаСтанции = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура СтанцияПриИзменении(Элемент)
	СтанцияПриИзмененииНаСервере();
КонецПроцедуры
